In [2]:
import duckdb

con = duckdb.connect("../data/warehouse/olist.duckdb")

In [3]:
con.execute("SHOW TABLES").fetchall()

[('customers',),
 ('order_items',),
 ('orders',),
 ('payments',),
 ('products',),
 ('reviews',),
 ('sellers',)]

In [4]:
con.execute("DESCRIBE orders").fetchdf()

                     column_name column_type null   key default extra
0                       order_id     VARCHAR  YES  None    None  None
1                    customer_id     VARCHAR  YES  None    None  None
2                   order_status     VARCHAR  YES  None    None  None
3       order_purchase_timestamp     VARCHAR  YES  None    None  None
4              order_approved_at     VARCHAR  YES  None    None  None
5   order_delivered_carrier_date     VARCHAR  YES  None    None  None
6  order_delivered_customer_date     VARCHAR  YES  None    None  None
7  order_estimated_delivery_date     VARCHAR  YES  None    None  None

In [13]:
con.execute("DESCRIBE order_items").fetchdf()

           column_name column_type null   key default extra
0             order_id     VARCHAR  YES  None    None  None
1        order_item_id      BIGINT  YES  None    None  None
2           product_id     VARCHAR  YES  None    None  None
3            seller_id     VARCHAR  YES  None    None  None
4  shipping_limit_date     VARCHAR  YES  None    None  None
5                price      DOUBLE  YES  None    None  None
6        freight_value      DOUBLE  YES  None    None  None

In [14]:
con.execute("DESCRIBE payments").fetchdf()

            column_name column_type null   key default extra
0              order_id     VARCHAR  YES  None    None  None
1    payment_sequential      BIGINT  YES  None    None  None
2          payment_type     VARCHAR  YES  None    None  None
3  payment_installments      BIGINT  YES  None    None  None
4         payment_value      DOUBLE  YES  None    None  None

In [9]:
con.execute("SELECT order_id, order_item_id, product_id FROM order_items LIMIT 5").fetchdf()

,order_id,order_item_id,product_id
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089

In [10]:
con.execute("SELECT order_id FROM orders LIMIT 5").fetchdf()

                           order_id
0  e481f51cbdc54678b7cc49136f2d6af7
1  53cdb2fc8bc7dce0b6741e2150273451
2  47770eb9100c2d0c44946d9cf07ec65d
3  949d5b44dbf5de918fe9c16f97b45f8a
4  ad21c59c0840e6cb83a9ceb5573f8159